[
  {
    "title": "Table Top Rpg Game Manager API",
    "time": "Oct 2023 - Present",
    "link": "https://github.com/rvtovar/game_management",
    "img_url": "assets/game_management.png",
    "bullets": [
        "Developed a RESTful API using Laravel and MariaDB to manage game data for a tabletop RPG, enabling users to create, update, and delete game data.",
        "Implemented a user authentication system with JWT tokens to secure user data and prevent unauthorized access.",
        "Utilized Laravel Eloquent ORM to interact with the database, enhancing data retrieval efficiency and application performance."
    ],
    "tech": ["PHP", "Laravel", "MariaDB"],
    "status": "completed"

  },
  {
    "title": "Alpha Blog",
    "time": "Oct 2023 - Present",
    "link": "https://github.com/rvtovar/alpha_blog",
    "img_url": "assets/alpha_blog.png",
    "bullets": [
        "Developed a blog application using Ruby on Rails and MariaDB, enabling users to create, edit, and delete blog posts.",
        "Implemented user authentication and authorization manually to secure user data and prevent unauthorized access.",
        "Utilized Tailwind to design a responsive user interface, enhancing user experience and application usability."
    ],
    "tech": ["Ruby", "Rails", "TailwindCss", "Javascript","MariaDB"],
    "status": "completed"

  },
  {
    "title":"Console To-Do's",
    "time": "Summer 2023",
    "link": "https://github.com/rvtovar/rust_todos",
    "img_url": "assets/todos.png",
    "bullets": [
      "Developed a console-based to-do application with integration into a local PostgreSQL database for efficient task management and data persistence.",
      "Implemented seamless user interactions to enhance the overall functionality of the application.",
      "Optimized code modules using Rust to improve performance and maintainability for the application."
    ],
    "tech": ["Rust", "PostgreSQl", "Tokio"],
    "status": "completed"
  },
  {
    "title": "Quick Organics Web Application",
    "time": "2022 - 2023",
    "link": "https://app.transition.quickorganics.com/login",
    "img_url": "assets/qoca.png",
    "bullets": [
      "Developed scalable APIs with Django Rest Framework and PostgreSQL, significantly enhancing data retrieval efficiency",
      "Conducted weekly Postgres Database migrations to ensure data integrity and optimize performance, utilizing advanced SQL queries",
      "Collaborated with cross-functional teams to implement scalable solutions, enhancing application responsiveness by 50% within the established timeframe."
    ],
    "tech": ["Python","Django Rest Framework", "PostgreSQL"],
    "status": "completed"
  }
]